In [2]:
import pandas as pd
import numpy as np

# Series
A series is a one-dimensional array-like object containg a sequence of values of the same type and an associated array of data labels, called its *index*.

In [3]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index = ["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2["a"]

-5

In [9]:
obj2["d"] = 6
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [13]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [14]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [15]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [17]:
"b" in obj2

True

In [18]:
"e" in obj2

False

In [19]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [20]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [22]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(data = sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [23]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [24]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [25]:
obj4.notna()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [26]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [27]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [28]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [30]:
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [31]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [32]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# DataFrame
A DataFrame represents a rectangular table of data and contains an ordered, named collection of columns, each of which can be a different value type.

In [33]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"], 
        "year": [2000, 2001, 2002, 2001, 2002, 2003], 
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [37]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [39]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [40]:
pd.DataFrame(data, columns = ["year", "pop", "state"])

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [42]:
frame2 = pd.DataFrame(data, columns=["year", "pop", "state", "debt"])
frame2

   year  pop   state debt
0  2000  1.5    Ohio  NaN
1  2001  1.7    Ohio  NaN
2  2002  3.6    Ohio  NaN
3  2001  2.4  Nevada  NaN
4  2002  2.9  Nevada  NaN
5  2003  3.2  Nevada  NaN

In [43]:
frame2.columns

Index(['year', 'pop', 'state', 'debt'], dtype='object')

In [44]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [45]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [48]:
frame2

   year  pop   state debt
0  2000  1.5    Ohio  NaN
1  2001  1.7    Ohio  NaN
2  2002  3.6    Ohio  NaN
3  2001  2.4  Nevada  NaN
4  2002  2.9  Nevada  NaN
5  2003  3.2  Nevada  NaN

In [49]:
frame2.loc[1]

year     2001
pop       1.7
state    Ohio
debt      NaN
Name: 1, dtype: object

In [50]:
frame2.iloc[2]

year     2002
pop       3.6
state    Ohio
debt      NaN
Name: 2, dtype: object

In [51]:
frame2.debt = 16.5
frame2

   year  pop   state  debt
0  2000  1.5    Ohio  16.5
1  2001  1.7    Ohio  16.5
2  2002  3.6    Ohio  16.5
3  2001  2.4  Nevada  16.5
4  2002  2.9  Nevada  16.5
5  2003  3.2  Nevada  16.5

In [52]:
frame2["debt"] = np.arange(6)
frame2

   year  pop   state  debt
0  2000  1.5    Ohio     0
1  2001  1.7    Ohio     1
2  2002  3.6    Ohio     2
3  2001  2.4  Nevada     3
4  2002  2.9  Nevada     4
5  2003  3.2  Nevada     5

In [54]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [62]:
frame2["debt"] = val
frame2

   year  pop   state  debt
0  2000  1.5    Ohio   NaN
1  2001  1.7    Ohio   NaN
2  2002  3.6    Ohio   NaN
3  2001  2.4  Nevada   NaN
4  2002  2.9  Nevada   NaN
5  2003  3.2  Nevada   NaN

In [64]:
del frame2["debt"]
frame2

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [65]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [66]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year  pop   state  eastern
0  2000  1.5    Ohio     True
1  2001  1.7    Ohio     True
2  2002  3.6    Ohio     True
3  2001  2.4  Nevada    False
4  2002  2.9  Nevada    False
5  2003  3.2  Nevada    False

In [67]:
del frame2["eastern"]
frame2

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [68]:
frame2.columns

Index(['year', 'pop', 'state'], dtype='object')

In [69]:
population = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 2.9}}
frame3 = pd.DataFrame(population)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [70]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [71]:
pd.DataFrame(population, index = [2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [72]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [73]:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [74]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [75]:
frame2

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [76]:
frame2.to_numpy()

array([[2000, 1.5, 'Ohio'],
       [2001, 1.7, 'Ohio'],
       [2002, 3.6, 'Ohio'],
       [2001, 2.4, 'Nevada'],
       [2002, 2.9, 'Nevada'],
       [2003, 3.2, 'Nevada']], dtype=object)

# Index Objects

In [78]:
obj = pd.Series(np.arange(3), index = ["a", "b", "c"])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [79]:
index[1:]

Index(['b', 'c'], dtype='object')

# Essential Functionality
### Reindexing
which means to create a new object with the values rearranged to align with the new index.

In [80]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [81]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [82]:
obj3 = pd.Series(["blue", "purple", "yellow"], index = [0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [83]:
obj3.reindex(np.arange(6), method = "ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [85]:
frame = pd.DataFrame(np.arange(9).reshape(3, 3), 
                    index = ["a", "c", "d"], 
                    columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [86]:
frame2 = frame.reindex(index = ["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [87]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [90]:
frame.reindex(labels=states, axis = 1)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [91]:
frame.reindex(labels=states, axis = "columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [92]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

# Dropping Enteries from an Axis

In [93]:
obj = pd.Series(np.arange(5), index = ["a", "b", "c", "d", "e"])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [94]:
new_obj = obj.drop("c")
new_obj

a    0
b    1
d    3
e    4
dtype: int64

In [95]:
obj.drop(["d", "c"])

a    0
b    1
e    4
dtype: int64

In [96]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                   index = ["Ohio", "Colorado", "Utah", "New York"], 
                   columns = ["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [97]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [98]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

# Indexing, Selection, and Filtering

In [3]:
obj = pd.Series(np.arange(4), index = ["a", "b", "c", "d"])
obj

a    0
b    1
c    2
d    3
dtype: int64

In [4]:
obj["b"]

1

In [9]:
obj[1]

/tmp/ipykernel_120/2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1

In [7]:
obj[["b", "a", "d"]]

b    1
a    0
d    3
dtype: int64

In [8]:
obj[[1, 3, 2]]

/tmp/ipykernel_120/3100806765.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1, 3, 2]]

b    1
d    3
c    2
dtype: int64

In [10]:
obj[obj < 2]

a    0
b    1
dtype: int64

In [11]:
obj.loc[["b", "a", "d"]]

b    1
a    0
d    3
dtype: int64

In [14]:
obj.iloc[[2, 3]]

c    2
d    3
dtype: int64

In [19]:
obj.loc["a":"c"]

a    0
b    1
c    2
dtype: int64

In [21]:
obj.iloc[1:3]

b    1
c    2
dtype: int64

In [22]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                   index = ["Ohio", "Colorado", "Utah", "New York"], 
                   columns = ["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [23]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [27]:
data.iloc[1]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [28]:
data[["two", "three"]]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [29]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [30]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [32]:
data[["one", "two", "three"]]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [33]:
data[data < 5] = 0

In [34]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

# Selection on DataFrame with loc and iloc

In [35]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [36]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [39]:
data.loc[["Colorado", "New York"], ["one", "two"]]

          one  two
Colorado    0    5
New York   12   13

In [40]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [41]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [42]:
data.iloc[2, 1]

9

In [44]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [45]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [46]:
data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [47]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [48]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

# Arithmetic and Data Alignment

In [49]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = ["a", "c", "e", "f", "g"])

In [50]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [51]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [52]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [53]:
df1 = pd.DataFrame(np.arange(9).reshape((3, 3)), 
                  columns = list("bcd"), 
                  index = ["Ohio", "Texas", "Colorado"])

df2 = pd.DataFrame(np.arange(12).reshape((4, 3)), 
                  columns=list("bde"), 
                  index = ["Utah", "Ohio", "Texas", "Oregon"])

In [54]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [55]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [57]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [58]:
df1 = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                  columns = list("abcd"))
df2 = pd.DataFrame(np.arange(20).reshape((4, 5)), 
                  columns = list("abcde"))

In [59]:
df2.loc[1, "b"] = np.nan

In [60]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [61]:
df2

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

In [62]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [63]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [67]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [68]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [69]:
df1.reindex(columns=df2.columns, fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

# Operations between DataFrame and Series

In [71]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [72]:
arr[0]

array([0, 1, 2, 3])

In [73]:
arr - arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [74]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)), 
                    columns=list("bde"), 
                    index = ["Utah", "Ohio", "Texas", "Oregon"])
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [76]:
series = frame.iloc[0]
series

b    0
d    1
e    2
Name: Utah, dtype: int64

In [77]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [78]:
series2 = pd.Series(np.arange(3), index = ["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int64

In [79]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [82]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [83]:
pd.DataFrame.add?

In [93]:
frame.add(series2, axis = "columns")

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [95]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [96]:
series3 = frame["d"]

In [98]:
frame.sub(series3, axis = "index")

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

# Function Application and Mapping

In [100]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)), 
                    columns = list("bde"), 
                    index = ["Utah", "Ohio", "Texas", "Oregon"]).round(1)
frame

          b    d    e
Utah    1.9 -1.1  1.3
Ohio   -1.6 -2.0  0.6
Texas   0.9  0.5  1.4
Oregon -2.8  0.9 -0.0

In [101]:
np.abs(frame)

          b    d    e
Utah    1.9  1.1  1.3
Ohio    1.6  2.0  0.6
Texas   0.9  0.5  1.4
Oregon  2.8  0.9  0.0

In [105]:
def f1(x):
    return x.max() - x.min()

frame.apply(f1, axis = 1)

Utah      3.0
Ohio      2.6
Texas     0.9
Oregon    3.7
dtype: float64

In [107]:
frame.apply(f1, axis = "index")

b    4.7
d    2.9
e    1.4
dtype: float64

In [108]:
def f2(x):
    return pd.Series([x.min(), x.max()], index = ["min", "max"])

In [111]:
frame.apply(f2, axis = "index")

       b    d    e
min -2.8 -2.0 -0.0
max  1.9  0.9  1.4

In [112]:
def f3(x):
    return f"{x:.2f}"

In [116]:
frame.map(f3)

            b      d      e
Utah     1.90  -1.10   1.30
Ohio    -1.60  -2.00   0.60
Texas    0.90   0.50   1.40
Oregon  -2.80   0.90  -0.00

In [117]:
frame

          b    d    e
Utah    1.9 -1.1  1.3
Ohio   -1.6 -2.0  0.6
Texas   0.9  0.5  1.4
Oregon -2.8  0.9 -0.0

# Sorting and Ranking

In [118]:
obj = pd.Series(np.arange(4), index = list("dabc"))
obj

d    0
a    1
b    2
c    3
dtype: int64

In [119]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [121]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), 
                    index = ["three", "one"], 
                    columns=list("dabc"))
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [123]:
frame.sort_index(axis = "index")

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [124]:
frame.sort_index(axis = "columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [125]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [128]:
obj.sort_values(ascending = True)

d    0
a    1
b    2
c    3
dtype: int64

In [129]:
obj.sort_values?

In [3]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [6]:
frame.sort_values("b", ascending = False)

   b  a
1  7  1
0  4  0
3  2  1
2 -3  0

In [9]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [10]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [12]:
obj.rank(method = "first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [36]:
obj.rank(ascending = False, method = "first")

0    1.0
1    7.0
2    2.0
3    3.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [37]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], 
                      "a": [0, 1, 0, 1], 
                      "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [38]:
frame.rank(axis = 1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [40]:
frame.rank(axis = 0, method = "first")

     b    a    c
0  3.0  1.0  2.0
1  4.0  3.0  3.0
2  1.0  2.0  4.0
3  2.0  4.0  1.0

# Axis Indexes with Duplicated Labels

In [41]:
obj = pd.Series(np.arange(5), index = list("aabbc"))
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [44]:
obj.index.is_unique

False

In [45]:
obj["a"]

a    0
a    1
dtype: int64

In [46]:
obj["c"]

4

In [50]:
df = pd.DataFrame(np.random.standard_normal((5, 3)), 
                 index = list("aabbc"), 
                 columns = ["one", "two", "three"])
df

        one       two     three
a -0.509983 -0.661589  1.033784
a -2.059124  1.366880  0.649289
b -0.702455 -0.192058 -0.601621
b -0.371855  0.268583  1.238110
c  1.207467 -0.386299  1.483753

In [51]:
df.loc["b"]

        one       two     three
b -0.702455 -0.192058 -0.601621
b -0.371855  0.268583  1.238110

In [53]:
df.loc["c"]

one      1.207467
two     -0.386299
three    1.483753
Name: c, dtype: float64

# Summarizing and Computing Descriptive Statistics

In [54]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], 
                  [np.nan, np.nan], [0.75, -1.3]], 
                 index = list("abcd"), 
                 columns = ["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [58]:
df.sum(axis = 0)

one    9.25
two   -5.80
dtype: float64

In [59]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [60]:
df.sum(axis = 1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [61]:
df.mean(axis = 1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [64]:
df.idxmax(axis = 0)

one    b
two    d
dtype: object

In [66]:
df.idxmax(axis = 1)

/tmp/ipykernel_165/2215755972.py:1: FutureWarning: The behavior of DataFrame.idxmax with all-NA values, or any-NA and skipna=False, is deprecated. In a future version this will raise ValueError
  df.idxmax(axis = 1)

a    one
b    one
c    NaN
d    one
dtype: object

In [69]:
df.cumsum(axis = 0)

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [70]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [71]:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [72]:
obj.count()

16

# Correlation and Covariance

In [74]:
price = pd.read_pickle("/home/yincy/git/github/pydata-book/examples/yahoo_price.pkl")
volume = pd.read_pickle("/home/yincy/git/github/pydata-book/examples/yahoo_volume.pkl")

In [75]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [76]:
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [77]:
returns = price.pct_change()
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [78]:
returns.tail

<bound method NDFrame.tail of                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]>

In [79]:
returns["MSFT"].corr(returns["IBM"])

0.4997636114415114

In [80]:
returns["MSFT"].cov(returns["IBM"])

8.870655479703545e-05

In [82]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [83]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [84]:
returns.corrwith(returns['IBM'])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [85]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

# Unique Values, Value Counts, and Membership

In [86]:
obj = pd.Series(["c", "a", "d", "e", "a", "a", "b", "b","c"])
obj

0    c
1    a
2    d
3    e
4    a
5    a
6    b
7    b
8    c
dtype: object

In [88]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'e', 'b'], dtype=object)

In [89]:
obj.value_counts()

a    3
c    2
b    2
d    1
e    1
Name: count, dtype: int64

In [90]:
mask = obj.isin(["b", "c"])
mask

0     True
1    False
2    False
3    False
4    False
5    False
6     True
7     True
8     True
dtype: bool

In [91]:
obj[mask]

0    c
6    b
7    b
8    c
dtype: object

In [92]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4], 
                    "Qu2": [2, 3, 1, 2, 3], 
                    "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [96]:
data["Qu1"].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [97]:
result = data.apply(pd.value_counts).fillna(0)
result

/tmp/ipykernel_165/1382616601.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [99]:
data.value_counts()

Qu1  Qu2  Qu3
1    2    1      1
3    2    4      1
     3    5      1
4    1    2      1
     3    4      1
Name: count, dtype: int64